БИТУправление_медицинским_центром_демо/src/InformationRegisters/СостоянияРассылокОтчетов/СостоянияРассылокОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияРассылокОтчетов</name>
  <resources>
    <name>ПоследнийЗапуск</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>УспешныйЗапуск</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НомерСеанса</name>
    <comment>Используется для отбора журнала регистрации по номеру сеанса рассылки отчетов. Подробнее см. НомерСеансаИнформационнойБазы в синтакс-помощнике.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>CatalogRef.РассылкиОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/СостоянияРассылокОтчетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Для внутреннего использования.
// 
// Параметры:
//  Рассылка - Неопределено
//
Процедура ЗафиксироватьЗапускРассылки(Рассылка) Экспорт
	Если ТипЗнч(Рассылка) <> Тип("СправочникСсылка.РассылкиОтчетов")
		Или Не ЗначениеЗаполнено(Рассылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Рассылка = Рассылка;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Рассылка = Рассылка;
	МенеджерЗаписи.ПоследнийЗапуск = ТекущаяДатаСеанса();
	МенеджерЗаписи.НомерСеанса = НомерСеансаИнформационнойБазы();
	МенеджерЗаписи.Выполнена = Ложь;
	МенеджерЗаписи.СОшибками = Истина;
	
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

// Для внутреннего использования.
// 
// Параметры:
//  Рассылка - Неопределено
//  РезультатВыполнения - Неопределено
//
Процедура ЗафиксироватьРезультатВыполненияРассылки(Рассылка, РезультатВыполнения) Экспорт
	Если ТипЗнч(Рассылка) <> Тип("СправочникСсылка.РассылкиОтчетов")
		Или Не ЗначениеЗаполнено(Рассылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Рассылка = Рассылка;
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи.Рассылка = Рассылка;
	МенеджерЗаписи.Выполнена = (
		РезультатВыполнения.ВыполненаВПапку
		ИЛИ РезультатВыполнения.ВыполненаВСетевойКаталог
		ИЛИ РезультатВыполнения.ВыполненаНаFTP
		ИЛИ РезультатВыполнения.ВыполненаПоЭлектроннойПочте);
	
	МенеджерЗаписи.СОшибками = РезультатВыполнения.БылиОшибки ИЛИ РезультатВыполнения.БылиПредупреждения;
	Если Не МенеджерЗаписи.СОшибками Тогда
		МенеджерЗаписи.УспешныйЗапуск = МенеджерЗаписи.ПоследнийЗапуск;
	КонецЕсли;
	
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
